InformationRegisters/уни_ОчередьВыгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>уни_ОчередьВыгрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уни_СостоянияОчередиВыгрузки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/уни_ОчередьВыгрузкиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>уни_ОчередьВыгрузкиДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уни_СостоянияОчередиВыгрузки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПакета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/уни_СостоянияОчередиВыгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>уни_СостоянияОчередиВыгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполняетсяГенерация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтправке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботеОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяВыгрузкаДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботеГенерацииДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДанныеВыгружены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/уни_ИнтеграцияСУБДСервер/Ext/Module.bsl
Процедура ЗарегистрироватьТаблицуВОчереди(Знач ПолноеИмяРегистра) Экспорт
	
	НачатьТранзакцию();
	Попытка
		МенеджерЗаписи = РегистрыСведений.уни_ОчередьВыгрузки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИмяТаблицы  = ПолноеИмяРегистра;
		МенеджерЗаписи.Статус = Перечисления.уни_СостоянияОчередиВыгрузки.Новый; 
		МенеджерЗаписи.ДатаРегистрации = ТекущаяДатаСеанса();
		МенеджерЗаписи.КоличествоПопыток = 0;
		
		МенеджерЗаписи.Записать(Истина);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗарегистрироватьТаблицуВОчередиДанных(Знач ПолноеИмяРегистра, Знач НомерПакета, Знач Состояние, Знач ПутьКФайлу = "") Экспорт
	
	НачатьТранзакцию();
	Попытка
		МенеджерЗаписи = РегистрыСведений.уни_ОчередьВыгрузкиДанных.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИмяТаблицы        = ПолноеИмяРегистра;
		МенеджерЗаписи.НомерПакета       = НомерПакета;
		
		МенеджерЗаписи.Статус            = Состояние;
		МенеджерЗаписи.ПутьКФайлуПакета  = ПутьКФайлу;
		МенеджерЗаписи.ДатаРегистрации   = ТекущаяДатаСеанса();
		МенеджерЗаписи.КоличествоПопыток = 0;
		МенеджерЗаписи.ТекстОшибки       = "";
		
		МенеджерЗаписи.Записать(Истина);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#Область ДвижокОчереди_Генератор

Процедура СформироватьПакетыМакетовДляВыгрузки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Очередь.ИмяТаблицы КАК ИмяТаблицы
		|ИЗ
		|	РегистрСведений.уни_ОчередьВыгрузки КАК Очередь
		|ГДЕ
		|	Очередь.Статус = ЗНАЧЕНИЕ(Перечисление.уни_СостоянияОчередиВыгрузки.Новый)
		|УПОРЯДОЧИТЬ ПО
		|	Очередь.ДатаРегистрации ВОЗР";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Выборка.Следующий() Тогда
		
		ПутьКФайлу = ПолучитьИмяВременногоФайла("json");
		
		Попытка
			ИзменитьСтатусЗадачи(Выборка.ИмяТаблицы, Перечисления.уни_СостоянияОчередиВыгрузки.ВыполняетсяГенерация);
			
			СгенерироватьJSONСтруктурыВФайл(Выборка.ИмяТаблицы, ПутьКФайлу);
			
			НачатьТранзакцию();
			МенеджерЗаписи = РегистрыСведений.уни_ОчередьВыгрузки.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ИмяТаблицы = Выборка.ИмяТаблицы;
			МенеджерЗаписи.Прочитать();
			
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.Статус = Перечисления.уни_СостоянияОчередиВыгрузки.ГотовКОтправке;
				МенеджерЗаписи.ПутьКФайлуПакета = ПутьКФайлу;
				МенеджерЗаписи.Записать(Истина);
			КонецЕсли;
			ЗафиксироватьТранзакцию();
			
		Исключение
			УдалитьФайлы(ПутьКФайлу);
			ЗаписьЖурналаРегистрации("СформироватьПакетыДанныхДляВыгрузки.Ошибка",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;;
	
КонецПроцедуры

Процедура СформироватьПакетыДанныхИзРегистров() Экспорт
	
	ЗапросОчереди = Новый Запрос;
	ЗапросОчереди.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Очередь.ИмяТаблицы КАК ИмяТаблицы,
		|	Очередь.НомерПакета КАК НомерПакета
		|ИЗ
		|	РегистрСведений.уни_ОчередьВыгрузкиДанных КАК Очередь
		|ГДЕ
		|	Очередь.Статус = ЗНАЧЕНИЕ(Перечисление.уни_СостоянияОчередиВыгрузки.Новый)
		|УПОРЯДОЧИТЬ ПО
		|	Очередь.ДатаРегистрации ВОЗР";
		
	Выборка = ЗапросОчереди.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяРегистра  = Выборка.ИмяТаблицы;
	СтартовыйНомер     = Выборка.НомерПакета;
	
	ИзменитьСтатусЗадачиДанных(ПолноеИмяРегистра, СтартовыйНомер, Перечисления.уни_СостоянияОчередиВыгрузки.ВРаботеГенерацииДанных);
	
	Попытка
		
		ВыгрузитьДанныеРегистраВФайлы(ПолноеИмяРегистра, СтартовыйНомер);
		
		УдалитьСтартовуюЗаписьДанных(ПолноеИмяРегистра);
		
	Исключение
		ЗаписьЖурналаРегистрации("СформироватьПакетыДанныхИзРегистров.Ошибка",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ВыгрузитьДанныеРегистраВФайлы(Знач ПолноеИмяРегистра, Знач СтартовыйНомерПакета)
	
	Метаобъект = Метаданные.НайтиПоПолномуИмени(ПолноеИмяРегистра);
	
	МассивПолей = Новый Массив;
	
	СтруктураТипов = Новый Соответствие;
	
	Для Каждого Реквизит Из Метаобъект.СтандартныеРеквизиты Цикл
		Если Реквизит.Имя = "Период" Или Реквизит.Имя = "Регистратор" Тогда
			МассивПолей.Добавить(Реквизит.Имя);
			СтруктураТипов.Вставить(Реквизит.Имя, Реквизит.Тип);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Измерение Из Метаобъект.Измерения Цикл
		МассивПолей.Добавить(Измерение.Имя);
		СтруктураТипов.Вставить(Измерение.Имя, Измерение.Тип);
	КонецЦикла;
	
	Для Каждого Ресурс Из Метаобъект.Ресурсы Цикл
		МассивПолей.Добавить(Ресурс.Имя);
		СтруктураТипов.Вставить(Ресурс.Имя, Ресурс.Тип); 
	КонецЦикла;
	
	ТекстЗапроса1С = СтрШаблон("ВЫБРАТЬ %1 ИЗ %2 КАК ТаблицаРегистра", СтрСоединить(МассивПолей, ", "), ПолноеИмяРегистра);
	ЗапросДанных   = Новый Запрос(ТекстЗапроса1С);
	ВыборкаДанных  = ЗапросДанных.Выполнить().Выбрать();
	
	ТекущийНомерПакета = СтартовыйНомерПакета + 1;
	СчетчикСтрок       = 0;
	ПакетЗапущен       = Ложь;
	ЗаписьJSON         = Неопределено;
	ПутьКФайлу         = "";
	
	Пока ВыборкаДанных.Следующий() Цикл
		
		Если СчетчикСтрок = 0 Тогда
			ПутьКФайлу = ПолучитьИмяВременногоФайла("json");
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.ОткрытьФайл(ПутьКФайлу, КодировкаТекста.UTF8, Ложь);
			
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
			ЗаписьJSON.ЗаписатьИмяСвойства("table_name");
			ЗаписьJSON.ЗаписатьЗначение(ТекстНижнийРегистр(Метаобъект.Имя));
			
			ЗаписьJSON.ЗаписатьИмяСвойства("rows");
			ЗаписьJSON.ЗаписатьНачалоМассива();
			ПакетЗапущен = Истина;
		КонецЕсли;
		
		ЗаписатьСтрокуДанныхВJSON(ЗаписьJSON, ВыборкаДанных, МассивПолей, СтруктураТипов);
		
		СчетчикСтрок = СчетчикСтрок + 1;
		
		Если СчетчикСтрок >= 5000 Тогда
			ЗаписьJSON.ЗаписатьКонецМассива();
			ЗаписьJSON.ЗаписатьКонецОбъекта();
			ЗаписьJSON.Закрыть();
			
			ЗарегистрироватьТаблицуВОчередиДанных(ПолноеИмяРегистра, ТекущийНомерПакета, Перечисления.уни_СостоянияОчередиВыгрузки.ГотовКОтправке, ПутьКФайлу);
			
			ТекущийНомерПакета = ТекущийНомерПакета + 1;
			СчетчикСтрок       = 0;
			ПакетЗапущен       = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПакетЗапущен Тогда
		ЗаписьJSON.ЗаписатьКонецМассива();
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		ЗаписьJSON.Закрыть();
		
		ЗарегистрироватьТаблицуВОчередиДанных(ПолноеИмяРегистра, ТекущийНомерПакета, Перечисления.уни_СостоянияОчередиВыгрузки.ГотовКОтправке, ПутьКФайлу);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьСтрокуДанныхВJSON(ЗаписьJSON, ВыборкаДанных, МассивПолей, СтруктураТипов)
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	Для Каждого ИмяПоля Из МассивПолей Цикл
		
		ЗаписьJSON.ЗаписатьИмяСвойства(ТекстНижнийРегистр(ИмяПоля));
		ЗначениеПоля = ВыборкаДанных[ИмяПоля];
		
		Если ЗначениеПоля = NULL Или ЗначениеПоля = Неопределено Тогда
			ЗаписьJSON.ЗаписатьЗначение("");
			Продолжить;
		КонецЕсли;
		
		ОписаниеТипа = СтруктураТипов[ИмяПоля];
		ТипСУБД      = ?(ОписаниеТипа <> Неопределено, ПолучитьТипДанныхSQL(ОписаниеТипа), "TEXT");
		
		Если ТипСУБД = "UUID" Тогда
			
			Если Не ЗначениеЗаполнено(ЗначениеПоля) Тогда
				ЗаписьJSON.ЗаписатьЗначение("00000000-0000-0000-0000-000000000000");
			Иначе
				ЗаписьJSON.ЗаписатьЗначение(Строка(ЗначениеПоля.УникальныйИдентификатор()));
			КонецЕсли;
			
		ИначеЕсли ТипСУБД = "TIMESTAMP" Тогда
			
			СтрокаДатыJSON = ЗаписатьДатуJSON(ЗначениеПоля, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.ЛокальнаяДата);
			ЗаписьJSON.ЗаписатьЗначение(СтрокаДатыJSON);
			
		ИначеЕсли Найти(ТипСУБД, "VARCHAR") > 0 Или ТипСУБД = "TEXT" Тогда
			
			ЗаписьJSON.ЗаписатьЗначение(Строка(ЗначениеПоля));
		Иначе
			
			ЗаписьJSON.ЗаписатьЗначение(ЗначениеПоля);
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
КонецПроцедуры

Процедура СгенерироватьJSONСтруктурыВФайл(Знач ПолноеИмяРегистра, Знач ПутьКФайлу)
	
	Метаобъект = Метаданные.НайтиПоПолномуИмени(ПолноеИмяРегистра);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ПутьКФайлу, КодировкаТекста.UTF8, Ложь); 
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("table_name");
	ЗаписьJSON.ЗаписатьЗначение(ТекстНижнийРегистр(Метаобъект.Имя));
	
	ЗаписьJSON.ЗаписатьИмяСвойства("columns");
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	Для Каждого Реквизит Из Метаобъект.СтандартныеРеквизиты Цикл
		Если Реквизит.Имя = "Период" Или Реквизит.Имя = "Регистратор" Тогда
			ЗаписьJSON.ЗаписатьИмяСвойства(ТекстНижнийРегистр(Реквизит.Имя));
			ЗаписьJSON.ЗаписатьЗначение(ПолучитьТипДанныхSQL(Реквизит.Тип));
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Измерение Из Метаобъект.Измерения Цикл
		ЗаписьJSON.ЗаписатьИмяСвойства(ТекстНижнийРегистр(Измерение.Имя));
		ЗаписьJSON.ЗаписатьЗначение(ПолучитьТипДанныхSQL(Измерение.Тип));
	КонецЦикла;
	
	Для Каждого Ресурс Из Метаобъект.Ресурсы Цикл
		ЗаписьJSON.ЗаписатьИмяСвойства(ТекстНижнийРегистр(Ресурс.Имя));
		ЗаписьJSON.ЗаписатьЗначение(ПолучитьТипДанныхSQL(Ресурс.Тип));
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	ЗаписьJSON.Закрыть();
	
КонецПроцедуры

#КонецОбласти


#Область ДвижокОчереди_Транспорт

Процедура ОтправитьГотовыеПакетыНаШлюз() Экспорт
	
	ЗапросСтруктуры = Новый Запрос;
	ЗапросСтруктуры.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1

		|	Очередь.ИмяТаблицы КАК ИмяТаблицы,
		|	Очередь.ПутьКФайлуПакета КАК ПутьКФайлуПакета,
		|	Очередь.КоличествоПопыток КАК КоличествоПопыток

		|ИЗ
		|	РегистрСведений.уни_ОчередьВыгрузки КАК Очередь
		|ГДЕ

		|	Очередь.Статус = ЗНАЧЕНИЕ(Перечисление.уни_СостоянияОчередиВыгрузки.ГотовКОтправке)
		|	И Очередь.КоличествоПопыток < 5
		|УПОРЯДОЧИТЬ ПО

		|	Очередь.ДатаРегистрации ВОЗР";
		
	ВыборкаСтруктуры = ЗапросСтруктуры.Выполнить().Выбрать();
	
	Если ВыборкаСтруктуры.Следующий() Тогда
		ВыполнитьСетевуюОтправкуПакета(ВыборкаСтруктуры, "/api/create-table", Истина);
		Возврат; 
	КонецЕсли;
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Очередь.ИмяТаблицы КАК ИмяТаблицы,
		|	Очередь.НомерПакета КАК НомерПакета,

		|	Очередь.ПутьКФайлуПакета КАК ПутьКФайлуПакета,
		|	Очередь.КоличествоПопыток КАК КоличествоПопыток
		|ИЗ

		|	РегистрСведений.уни_ОчередьВыгрузкиДанных КАК Очередь
		|ГДЕ
		|	Очередь.Статус = ЗНАЧЕНИЕ(Перечисление.уни_СостоянияОчередиВыгрузки.ГотовКОтправке)

		|	И Очередь.КоличествоПопыток < 5
		|УПОРЯДОЧИТЬ ПО
		|	Очередь.ДатаРегистрации ВОЗР";
		
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	
	Если ВыборкаДанных.Следующий() Тогда
		ВыполнитьСетевуюОтправкуПакета(ВыборкаДанных, "/api/upload-data", Ложь);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьСетевуюОтправкуПакета(Знач ВыборкаОчереди, Знач ЭндпоинтURL, Знач ЭтоСтруктура) Экспорт
	
	ФайлНаДиске = Новый Файл(ВыборкаОчереди.ПутьКФайлуПакета);
	Если Не ФайлНаДиске.Существует() Тогда
		Если ЭтоСтруктура Тогда
			ВернутьЗадачуНаПерегенерацию(ВыборкаОчереди.ИмяТаблицы);
		Иначе
			ВернутьЗадачуДанныхНаПерегенерацию(ВыборкаОчереди.ИмяТаблицы, ВыборкаОчереди.НомерПакета);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Попытка
		Если ЭтоСтруктура Тогда
			ИзменитьСтатусЗадачи(ВыборкаОчереди.ИмяТаблицы, Перечисления.уни_СостоянияОчередиВыгрузки.ВРаботеОтправки);
		Иначе
			ИзменитьСтатусЗадачиДанных(ВыборкаОчереди.ИмяТаблицы, ВыборкаОчереди.НомерПакета, Перечисления.уни_СостоянияОчередиВыгрузки.ВРаботеОтправки);
		КонецЕсли;
		
		HTTP = Новый HTTPСоединение("127.0.0.1", 5000);
		ЗапросHTTP = Новый HTTPЗапрос(ЭндпоинтURL);
		
		ЗапросHTTP.УстановитьИмяФайлаТела(ВыборкаОчереди.ПутьКФайлуПакета);
		ЗапросHTTP.Заголовки.Вставить("Content-Type", "application/json");
		
		Ответ = HTTP.ОтправитьДляОбработки(ЗапросHTTP);
		
		Если Ответ.КодСостояния = 200 Тогда
			
			ЗапросHTTP = Неопределено; 
			
			УдалитьФайлы(ВыборкаОчереди.ПутьКФайлуПакета);
			
			Если ЭтоСтруктура Тогда
				ФиксироватьУспешнуюОтправку(ВыборкаОчереди.ИмяТаблицы);
			Иначе
				ФиксироватьУспешнуюОтправкуДанных(ВыборкаОчереди.ИмяТаблицы, ВыборкаОчереди.НомерПакета);
			КонецЕсли;
			
		Иначе
			ТекстОшибкиШлюза = Ответ.ПолучитьТелоКакСтроку();
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Шлюз вернул код %1. Ответ: %2'"), Ответ.КодСостояния, ТекстОшибкиШлюза);
		КонецЕсли;
		
	Исключение

		 Если ЭтоСтруктура Тогда
			ФиксироватьСбойОтправки(ВыборкаОчереди.ИмяТаблицы, ВыборкаОчереди.КоличествоПопыток + 1, ОписаниеОшибки());
		Иначе
			ФиксироватьСбойОтправкиДанных(ВыборкаОчереди.ИмяТаблицы, ВыборкаОчереди.НомерПакета, ВыборкаОчереди.КоличествоПопыток + 1, ОписаниеОшибки());
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыРаботыСОчередью

Процедура ИзменитьСтатусЗадачи(Знач ИмяТаблицы, Знач НовыйСтатус)
	
	НачатьТранзакцию();
	Попытка
		МенеджерЗаписи = РегистрыСведений.уни_ОчередьВыгрузки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИмяТаблицы = ИмяТаблицы;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Статус = НовыйСтатус;
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение; 
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаписатьОшибкуЗадачи(Знач ИмяТаблицы, Знач ТекстОшибки)
	
	НачатьТранзакцию();
	Попытка
		МенеджерЗаписи = РегистрыСведений.уни_ОчередьВыгрузки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИмяТаблицы = ИмяТаблицы;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Статус             = Перечисления.уни_СостоянияОчередиВыгрузки.Ошибка;
			МенеджерЗаписи.КоличествоПопыток = МенеджерЗаписи.КоличествоПопыток + 1;
			МенеджерЗаписи.ТекстОшибки        = ТекстОшибки;
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ВернутьЗадачуНаПерегенерацию(Знач ИмяТаблицы)
	
	НачатьТранзакцию();
	Попытка
		МенеджерЗаписи = РегистрыСведений.уни_ОчередьВыгрузки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИмяТаблицы = ИмяТаблицы;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Статус             = Перечисления.уни_СостоянияОчередиВыгрузки.Новый;
			МенеджерЗаписи.ПутьКФайлуПакета   = "";
			МенеджерЗаписи.ТекстОшибки        = НСтр("ru = 'Временный файл удален операционной системой. Направлен на перегенерацию.'");
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ФиксироватьСбойОтправки(Знач ИмяТаблицы, Знач НовоеКоличествоПопыток, Знач ОписаниеОшибки)
	
	НачатьТранзакцию();
	Попытка
		МенеджерЗаписи = РегистрыСведений.уни_ОчередьВыгрузки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИмяТаблицы = ИмяТаблицы;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Статус             = Перечисления.уни_СостоянияОчередиВыгрузки.Ошибка;
			МенеджерЗаписи.КоличествоПопыток = НовоеКоличествоПопыток;
			МенеджерЗаписи.ТекстОшибки        = ОписаниеОшибки;
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Событие = Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий, ДатаСобытия", "уни_УниверсальнаяИнтеграция.ОшибкаТранспортаHTTP", "Предупреждение",
		СтрШаблон(НСтр("ru = 'Ошибка отправки таблицы %1. Попытка №%2. Ошибка: %3'"), 
			ИмяТаблицы, НовоеКоличествоПопыток, ОписаниеОшибки), ТекущаяДатаСеанса());
	ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(Событие);
	
КонецПроцедуры

Процедура УдалитьЗадачуИзОчереди(Знач ИмяТаблицы)
	
	НачатьТранзакцию();
	Попытка
		МенеджерЗаписи = РегистрыСведений.уни_ОчередьВыгрузки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИмяТаблицы = ИмяТаблицы;
		МенеджерЗаписи.Удалить();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ФиксироватьУспешнуюОтправку(Знач ИмяТаблицы)
	
	НачатьТранзакцию();
	Попытка
		МенеджерЗаписи = РегистрыСведений.уни_ОчередьВыгрузки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИмяТаблицы = ИмяТаблицы;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Статус             = Перечисления.уни_СостоянияОчередиВыгрузки.Отправлено;
			МенеджерЗаписи.ПутьКФайлуПакета   = ""; 
			МенеджерЗаписи.ТекстОшибки        = "";
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
		
		МенеджерДанных = РегистрыСведений.уни_ОчередьВыгрузкиДанных.СоздатьМенеджерЗаписи();
		МенеджерДанных.ИмяТаблицы = ИмяТаблицы;
		МенеджерДанных.НомерПакета = 0;
		МенеджерДанных.Статус  = Перечисления.уни_СостоянияОчередиВыгрузки.Новый;
		МенеджерДанных.ДатаРегистрации = ТекущаяДатаСеанса();
		МенеджерДанных.КоличествоПопыток = 0;
		МенеджерДанных.Записать(Истина);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьСтартовуюЗаписьДанных(Знач ИмяТаблицы) Экспорт
	
	НачатьТранзакцию();
	Попытка
		МенеджерЗаписи = РегистрыСведений.уни_ОчередьВыгрузкиДанных.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИмяТаблицы  = ИмяТаблицы;
		МенеджерЗаписи.НомерПакета = 0;
		МенеджерЗаписи.Удалить();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры

Процедура ИзменитьСтатусЗадачиДанных(Знач ИмяТаблицы, Знач НомерПакета, Знач НовыйСтатус) Экспорт
	НачатьТранзакцию();
	Попытка
		МенеджерЗаписи = РегистрыСведений.уни_ОчередьВыгрузкиДанных.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИмяТаблицы  = ИмяТаблицы;
		МенеджерЗаписи.НомерПакета = НомерПакета;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Статус = НовыйСтатус;
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

Процедура ФиксироватьУспешнуюОтправкуДанных(Знач ИмяТаблицы, Знач НомерПакета) Экспорт
	НачатьТранзакцию();
	Попытка
		МенеджерЗаписи = РегистрыСведений.уни_ОчередьВыгрузкиДанных.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИмяТаблицы  = ИмяТаблицы;
		МенеджерЗаписи.НомерПакета = НомерПакета;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Статус          = Перечисления.уни_СостоянияОчередиВыгрузки.Отправлено;
			МенеджерЗаписи.ПутьКФайлуПакета   = "";
			МенеджерЗаписи.ТекстОшибки        = "";
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

Процедура ФиксироватьСбойОтправкиДанных(Знач ИмяТаблицы, Знач НомерПакета, Знач НовоеКоличествоПопыток, Знач ОписаниеОшибки) Экспорт
	НачатьТранзакцию();
	Попытка
		МенеджерЗаписи = РегистрыСведений.уни_ОчередьВыгрузкиДанных.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИмяТаблицы  = ИмяТаблицы;
		МенеджерЗаписи.НомерПакета = НомерПакета;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Статус         = Перечисления.уни_СостоянияОчередиВыгрузки.Ошибка;
			МенеджерЗаписи.КоличествоПопыток = НовоеКоличествоПопыток;
			МенеджерЗаписи.ТекстОшибки       = ОписаниеОшибки;
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
КонецПроцедуры

Процедура ВернутьЗадачуДанныхНаПерегенерацию(Знач ИмяТаблицы, Знач НомерПакета) Экспорт
	
	ЗапросПакетов = Новый Запрос;
	ЗапросПакетов.Текст = 
		"ВЫБРАТЬ

		|	Очередь.ПутьКФайлуПакета КАК ПутьКФайлуПакета
		|ИЗ
		|	РегистрСведений.уни_ОчередьВыгрузкиДанных КАК Очередь

		|ГДЕ
		|	Очередь.ИмяТаблицы = &ИмяТаблицы";
	ЗапросПакетов.УстановитьПараметр("ИмяТаблицы", ИмяТаблицы);
	
	ВыборкаПакетов = ЗапросПакетов.Выполнить().Выбрать();
	Пока ВыборкаПакетов.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаПакетов.ПутьКФайлуПакета) Тогда
			УдалитьФайлы(ВыборкаПакетов.ПутьКФайлуПакета);
		КонецЕсли;
	КонецЦикла;
	
	НачатьТранзакцию();
	Попытка
		НаборЗаписей = РегистрыСведений.уни_ОчередьВыгрузкиДанных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИмяТаблицы.Установить(ИмяТаблицы);
		НаборЗаписей.Записать(Истина); 
		
		МенеджерМаркера = РегистрыСведений.уни_ОчередьВыгрузкиДанных.СоздатьМенеджерЗаписи();
		МенеджерМаркера.ИмяТаблицы        = ИмяТаблицы;
		МенеджерМаркера.НомерПакета       = 0;
		МенеджерМаркера.Статус         = Перечисления.уни_СостоянияОчередиВыгрузки.Новый;
		МенеджерМаркера.ДатаРегистрации   = ТекущаяДатаСеанса();
		МенеджерМаркера.КоличествоПопыток = 0;
		МенеджерМаркера.ТекстОшибки       = НСтр("ru = 'Один из файлов пакетов был утерян. Вся серия сброшена и направлена на перегенерацию.'");
		
		МенеджерМаркера.Записать(Истина);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры


#КонецОбласти

#Область ПеречисленияСтатусовИВспомогательныеМетоды
Функция ПолучитьТипДанныхSQL(Знач ОписаниеТипа) Экспорт
	
	МассивТипов = ОписаниеТипа.Типы();
	
	Для Каждого ТекущийТип Из МассивТипов Цикл

		Если ТекущийТип <> Тип("Число") 
			И ТекущийТип <> Тип("Строка") 
			И ТекущийТип <> Тип("Дата") 
			И ТекущийТип <> Тип("Булево") Тогда
			
			Возврат "UUID"; 
		КонецЕсли;
	КонецЦикла;
	
	Если ОписаниеТипа.СодержитТип(Тип("Строка")) Тогда

		Квалификаторы = ОписаниеТипа.КвалификаторыСтроки;
		Если Квалификаторы <> Неопределено И Квалификаторы.Длина > 0 Тогда
			Возврат СтрШаблон("VARCHAR(%1)", Квалификаторы.Длина);
		Иначе
			Возврат "TEXT";
		КонецЕсли;
		
	ИначеЕсли ОписаниеТипа.СодержитТип(Тип("Число")) Тогда
		Квалификаторы = ОписаниеТипа.КвалификаторыЧисла;
		Если Квалификаторы <> Неопределено Тогда
			Длина   = ?(Квалификаторы.Разрядность = 0, 15, Квалификаторы.Разрядность);
			Точность = Квалификаторы.РазрядностьДробнойЧасти;
			Возврат СтрШаблон("NUMERIC(%1,%2)", Длина, Точность);
		Иначе
			Возврат "NUMERIC(15,2)";
		КонецЕсли;
		
	ИначеЕсли ОписаниеТипа.СодержитТип(Тип("Дата")) Тогда
		Возврат "TIMESTAMP"; 
		
	ИначеЕсли ОписаниеТипа.СодержитТип(Тип("Булево")) Тогда
		Возврат "BOOLEAN";
		
	КонецЕсли;
	
	Возврат "VARCHAR(255)"; 
	
КонецФункции

Функция ТекстНижнийРегистр(Знач Значение)
	Возврат НРег(СтрЗаменить(Значение, ".", "_"));
КонецФункции
#КонецОбласти
